# ============================================================
# greetings.py
# كل حاجة خاصة بتصنيف greetings
# ============================================================

GREETINGS_ENTITIES = {
    "islamic_greet": ["السلام عليكم"],
    "morning_greet": ["صباح الخير", "صباح النور", "صباحو"],
    "evening_greet": ["مساء الخير", "مساء النور", "مسا مسا"],
    "general_greet": ["hi", "hello", "اهلا", "مرحبا", "ازيك", "hey", "how are u"],
    "thanks": ["شكرا", "تسلم", "حبيبي", "جزاكم الله خيرا", "thanks", "thank you"],
}

DESCRIPTION = "لسة محددتش محتاج ايه؟"

# ردود عشوائية لكل نوع تحية
GREETINGS_RESPONSES = {
    "islamic_greet": ["وعليكم السلام ورحمة الله وبركاته! أقدر أساعدك ازاي؟"],
    "morning_greet": [ "صباح النور! انا جاهز لمساعدتك في اللي محتاجه", "صباح الفل عليك! اقدر أساعدك ازاي النهاردة؟"],
    "evening_greet": ["مساء النور! محتاج مساعدة في إيه؟","مساء الفل ! انا جاهز لمساعدتك"],
    "general_greet": ["أهلاً وسهلا بيك! اقدر أساعدك ازاي النهاردة؟", "هاي! عامل ايه؟ انا مستعد لاسئلتك واستفساراتك"],
    "thanks": ["العفو! تحت أمرك دايماً 😊", "ولا يهمك! لو احتجت حاجة تانية قولي"],
}

def handle(user_input, entity, is_short_func, user_data={}):
    """الـ handler الخاص بـ greetings"""
    import random
    if not entity:
        return "انا شات بوت مصمم عشان اساعدك وارشدك سواء في التمرين أو التغذية"

    responses = GREETINGS_RESPONSES.get(entity, ["أهلاً بيك!"])
    return random.choice(responses)
